In [1]:
import pandas as pd

In [2]:
data = pd.read_csv(r"C:\Users\khans\Desktop\Numpy\sales_data.csv")

In [5]:
data

       Name Product Name  Sale Price    MRP  Rating   Sale Date
0     Alice     Product1       100.0  120.0     4.5  01-08-2023
1       Bob     Product2       150.0  170.0     4.0  02-08-2023
2   Charlie          NaN       200.0    NaN     3.5  03-08-2023
3     David     Product4         NaN  210.0     5.0  04-08-2023
4       Eva     Product5       250.0  270.0     NaN  05-08-2023
5     Frank          NaN       300.0  320.0     4.7         NaN
6     Grace     Product7       350.0    NaN     4.1  07-08-2023
7     Helen     Product8         NaN  370.0     3.8  08-08-2023
8       Ivy     Product9       400.0  420.0     NaN         NaN
9      Jack          NaN       450.0    NaN     4.3  10-08-2023
10     Kara    Product11       500.0  520.0     4.9  11-08-2023
11      Leo    Product12         NaN  570.0     NaN         NaN
12     Mona    Product13       550.0    NaN     3.9  13-08-2023
13     Nina    Product14       600.0  620.0     4.6  14-08-2023
14    Oscar          NaN       650.0  670.0     4.2  15-08-2023

In [5]:
pd.read_csv(r"C:\Users\khans\Desktop\Numpy\duplicate values.csv")

       Name Product Name  Sale Price    MRP  Rating   Sale Date
0     Alice     Product1       100.0  120.0     4.5  01-08-2023
1       Bob     Product2       150.0  170.0     4.0  02-08-2023
2   Charlie          NaN       200.0    NaN     3.5  03-08-2023
3     David     Product4         NaN  210.0     5.0  04-08-2023
4       Eva     Product5       250.0  270.0     NaN  05-08-2023
5     Frank          NaN       300.0  320.0     4.7         NaN
6     Grace     Product7       350.0    NaN     4.1  07-08-2023
7     Helen     Product8         NaN  370.0     3.8  08-08-2023
8       Ivy     Product9       400.0  420.0     NaN         NaN
9      Jack          NaN       450.0    NaN     4.3  10-08-2023
10     Kara    Product11       500.0  520.0     4.9  11-08-2023
11      Leo    Product12         NaN  570.0     NaN         NaN
12     Mona    Product13       550.0    NaN     3.9  13-08-2023
13     Nina    Product14       600.0  620.0     4.6  14-08-2023
14    Oscar          NaN       650.0  670.0     4.2  15-08-2023
15     Nina    Product14       600.0  620.0     4.6  14-08-2023
16    Alice     Product1       100.0  120.0     4.5  01-08-2023

In [55]:
type(data)

pandas.core.frame.DataFrame

In [ ]:
# numpy
# 2, dataframe   two-dimensional
# 1, series   one-dimensional

In [59]:
data.head()

      Name Product Name  Sale Price    MRP  Rating   Sale Date
0    Alice     Product1       100.0  120.0     4.5  01-08-2023
1      Bob     Product2       150.0  170.0     4.0  02-08-2023
2  Charlie          NaN       200.0    NaN     3.5  03-08-2023
3    David     Product4         NaN  210.0     5.0  04-08-2023
4      Eva     Product5       250.0  270.0     NaN  05-08-2023

In [61]:
data.tail()

     Name Product Name  Sale Price    MRP  Rating   Sale Date
10   Kara    Product11       500.0  520.0     4.9  11-08-2023
11    Leo    Product12         NaN  570.0     NaN         NaN
12   Mona    Product13       550.0    NaN     3.9  13-08-2023
13   Nina    Product14       600.0  620.0     4.6  14-08-2023
14  Oscar          NaN       650.0  670.0     4.2  15-08-2023

In [63]:
data.describe()

       Sale Price         MRP     Rating
count   12.000000   11.000000  12.000000
mean   375.000000  387.272727   4.291667
std    180.277564  188.366181   0.460155
min    100.000000  120.000000   3.500000
25%    237.500000  240.000000   3.975000
50%    375.000000  370.000000   4.250000
75%    512.500000  545.000000   4.625000
max    650.000000  670.000000   5.000000

In [41]:
data["MRP"].fillna(250)

0     120.0
1     170.0
2     250.0
3     210.0
4     270.0
5     320.0
6     250.0
7     370.0
8     420.0
9     250.0
10    520.0
11    570.0
12    250.0
13    620.0
14    670.0
Name: MRP, dtype: float64

In [47]:
data["MRP"].mean()

387.27272727272725

In [55]:
type(data['Sale Price'].mode())

pandas.core.series.Series

In [57]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          15 non-null     object
 1   Product Name  11 non-null     object
 2   Sale Price    12 non-null     float64
 3   MRP           11 non-null     float64
 4   Rating        12 non-null     float64
 5   Sale Date     12 non-null     object
dtypes: float64(3), object(3)
memory usage: 852.0+ bytes

In [94]:
data.iloc[:,2:3]

    Sale Price
0        100.0
1        150.0
2        200.0
3          NaN
4        250.0
5        300.0
6        350.0
7          NaN
8        400.0
9        450.0
10       500.0
11         NaN
12       550.0
13       600.0
14       650.0

In [96]:
data.loc[:2,["MRP"]]

     MRP
0  120.0
1  170.0
2    NaN

In [98]:
data.loc[:2,"MRP"]

0    120.0
1    170.0
2      NaN
Name: MRP, dtype: float64

In [65]:
data.columns

Index(['Name', 'Product Name', 'Sale Price', 'MRP', 'Rating', 'Sale Date'], dtype='object')

In [67]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
Sale Price,12.0,375.000000,180.277564,100.0,237.500,375.00,512.500,650.0
MRP,11.0,387.272727,188.366181,120.0,240.000,370.00,545.000,670.0
Rating,12.0,4.291667,0.460155,3.5,3.975,4.25,4.625,5.0

In [71]:
data.isna()

     Name  Product Name  Sale Price    MRP  Rating  Sale Date
0   False         False       False  False   False      False
1   False         False       False  False   False      False
2   False          True       False   True   False      False
3   False         False        True  False   False      False
4   False         False       False  False    True      False
5   False          True       False  False   False       True
6   False         False       False   True   False      False
7   False         False        True  False   False      False
8   False         False       False  False    True       True
9   False          True       False   True   False      False
10  False         False       False  False   False      False
11  False         False        True  False    True       True
12  False         False       False   True   False      False
13  False         False       False  False   False      False
14  False          True       False  False   False      False

In [79]:
new_Data = data.isna().sum()

In [75]:
type(data.isna().sum())

pandas.core.series.Series

In [87]:
new_Data

Name            0
Product Name    4
Sale Price      3
MRP             4
Rating          3
Sale Date       3
dtype: int64

In [91]:
new_Data[0]

C:\Users\khans\AppData\Local\Temp\ipykernel_20912\1614202573.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  new_Data[0]

0

In [93]:
data["Name"]

0       Alice
1         Bob
2     Charlie
3       David
4         Eva
5       Frank
6       Grace
7       Helen
8         Ivy
9        Jack
10       Kara
11        Leo
12       Mona
13       Nina
14      Oscar
Name: Name, dtype: object

In [103]:
data["Sale Price"].sum()

4500.0

In [105]:
type(data["Sale Price"])

pandas.core.series.Series

In [109]:
data["Sale Date"].dtype

dtype('O')

In [111]:
data.values

array([['Alice', 'Product1', 100.0, 120.0, 4.5, '01-08-2023'],
       ['Bob', 'Product2', 150.0, 170.0, 4.0, '02-08-2023'],
       ['Charlie', nan, 200.0, nan, 3.5, '03-08-2023'],
       ['David', 'Product4', nan, 210.0, 5.0, '04-08-2023'],
       ['Eva', 'Product5', 250.0, 270.0, nan, '05-08-2023'],
       ['Frank', nan, 300.0, 320.0, 4.7, nan],
       ['Grace', 'Product7', 350.0, nan, 4.1, '07-08-2023'],
       ['Helen', 'Product8', nan, 370.0, 3.8, '08-08-2023'],
       ['Ivy', 'Product9', 400.0, 420.0, nan, nan],
       ['Jack', nan, 450.0, nan, 4.3, '10-08-2023'],
       ['Kara', 'Product11', 500.0, 520.0, 4.9, '11-08-2023'],
       ['Leo', 'Product12', nan, 570.0, nan, nan],
       ['Mona', 'Product13', 550.0, nan, 3.9, '13-08-2023'],
       ['Nina', 'Product14', 600.0, 620.0, 4.6, '14-08-2023'],
       ['Oscar', nan, 650.0, 670.0, 4.2, '15-08-2023']], dtype=object)

In [113]:
type(data.values)

numpy.ndarray

In [9]:
data.dropna()

     Name Product Name  Sale Price    MRP  Rating   Sale Date
0   Alice     Product1       100.0  120.0     4.5  01-08-2023
1     Bob     Product2       150.0  170.0     4.0  02-08-2023
10   Kara    Product11       500.0  520.0     4.9  11-08-2023
13   Nina    Product14       600.0  620.0     4.6  14-08-2023

In [11]:
data.dropna(axis=1)

       Name
0     Alice
1       Bob
2   Charlie
3     David
4       Eva
5     Frank
6     Grace
7     Helen
8       Ivy
9      Jack
10     Kara
11      Leo
12     Mona
13     Nina
14    Oscar

In [9]:
# df1 = pd.DataFrame({
#     'ID': [1, 2, 3,500],
#     'Name':
#     ['Anas', 'bob', 'char','dog']
# )}


df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name':
    ['Abuzar', 'Mu', 'Bihar']

})

In [5]:
import pandas as pd
pd.set_option('display.max_rows',1000)
pd.set_option('display.max_columns', 1000)

#different file encoding types
df = pd.read_csv('file.csv',encoding='windows-1252')
df = pd.read_csv('file.csv',encoding='iso-8859-2')
df = pd.read_csv('file.csv',encoding='utf-16le')
df = pd.read_csv('file.csv',encoding='utf-16be')
df = pd.read_csv('file.csv',encoding='ascii')
df = pd.read_csv('file.csv',encoding='cp1252')

In [11]:
data = pd.read_csv(r"C:\Users\khans\Desktop\Numpy\sales_data.csv")

In [29]:
import pandas as pd

df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name':
    ['Abuzar', 'Mu', 'Bihar']

})

# df2 = pd.DataFrame({
#     'ID': [2, 3, 4],
#     'Age': [25, 30, 35]

# })

In [31]:
df1

   ID    Name
0   1  Abuzar
1   2      Mu
2   3   Bihar

In [33]:
df1 = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Name':
    ['Abuzar', 'Mu', 'Bihar',"Anas"]

})

In [35]:
df1

   ID    Name
0   1  Abuzar
1   2      Mu
2   3   Bihar
3   4    Anas

In [45]:
series = pd.Series({'ID': [1, 2, 3, 4],})
type(df1)

pandas.core.frame.DataFrame

In [43]:
series

ID    [1, 2, 3, 4]
dtype: object